Revit 2027 API
FabricationPartRouteEnd Methods
The FabricationPartRouteEnd type exposes the following members.
Methods
Name | Description
CreateFromCenterline |  Create fabrication routing end from centerline point on straight element.
CreateFromConnector |  Create fabrication routing end from connector end point.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace